/*!
\file Compare.c
\brief Основной файл функций compare

Содерижит реализацию функций, предназначенных для сравнения значений, содержащихся в нодах ДБП
*/

#include "Compare.h"
#include "Keyvalue.h"
#include <stdio.h>
#include <string.h>
#include <stdlib.h>

//////////////////////////////////////////////////////////////////////////////////////////////////////
/// \brief Сравнение для int
///
/// Сравнение для указателей типа void, подразумевающих содержащееся в них значение типа int
///
/// \param s1 указатель на первое сравниваемое значение
/// \param s2 указатель на второе сравниваемое значение
/// \return 1 -> если первое значение больше, -1 -> первое значение меньше, 0 -> если значения равны
//////////////////////////////////////////////////////////////////////////////////////////////////////
int compare(void *s1, void *s2) {
  int *a = (int *)s1;
  int *b = (int *)s2;
  if ((*a) > (*b))
    return 1;
  else if ((*a) < (*b))
    return -1;
  else
    return 0;
}

//////////////////////////////////////////////////////////////////////////////////////////////////////
/// \brief Сравнение для реализованного типа keyvalue
///
/// Сравнение для указателей типа void, подразумевающих содержащееся в них значение реализованного типа keyvalue
///
/// \param entry_one указатель на первое сравниваемое значение
/// \param entry_two указатель на второе сравниваемое значение
/// \return 1 -> если сравнение полей key первого и второго значения соответственно с помощью стандартной функции strcmp > 0, -1 -> если сравнение полей key первого и второго значения соответственно с помощью стандартной функции strcmp < 0, 0 -> если сравнение полей key первого и второго значения соответственно с помощью стандартной функции strcmp = 0
//////////////////////////////////////////////////////////////////////////////////////////////////////
int compare_string_keys(void *entry_one, void *entry_two){
    if (strcmp((char *)(((struct keyvalue *)entry_one)->key), (char *)(((struct keyvalue *)entry_two)->key)) > 0){
        return 1;
    }
    else if (strcmp((char *)(((struct keyvalue *)entry_one)->key), (char *)(((struct keyvalue *)entry_two)->key)) < 0){
        return -1;
    }
    else{
        return 0;
    }
}